Tutorial_benchmark_2_CAARC/0/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            zeroGradient;
    }

    outlet
    {
	type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    tubesfs
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            symmetry;
    }



}

// ************************************************************************* //
